backend/app/Controllers/Saldo.php

SELECT *
FROM `saldo`
WHERE `saldo`.`id` = 1
---
    public function index($id = null)
    {
        $model = new SaldoModel();
        $saldo = $model->find(1);